const postItms = {
    today: [
        {id: "hunger-game",
            name:"Голодные игры: Баллада о змеях и певчих птицах",
            data: "2023",
            tim: "157 мин",
            src: "photo/пост1.png",
            alt: "пост1",
            synopsis: "До того как стать деспотичным президентом Панэма, молодой Кориолан Сноу был последней надеждой своего увядающего рода — некогда великой династии, впавшей в немилость послевоенного Капитолия. Накануне десятых ежегодных Голодных игр Сноу назначают наставником Люси Грей Бэйрд — трибута дистрикта 12. Постепенно девушка привлекает все больше внимание Панэма, становясь фавориткой грядущего соревнования. Готовый на всё, чтобы вернуть своей семье былое величие, Сноу решает обратить ситуацию с Люси в свою пользу. Начинается гонка со временем, которая покажет, кто певчая птица, а кто — змея.",

        },
        {id: "gely",
            name:"Геля",
            data: "21 августа 2025 г",
            tim: "95 мин",
            src: "photo/пост2.png",
            alt: "фото Геля",
            synopsis: "Саня — дальнобойщик, который совмещает основную работу с угоном машин. Они с женой Аней со дня на день ждут рождения ребенка. Внезапно Сане поступает срочный заказ: угон «Гелендвагена» (или просто «Гели»). И ради безбедного будущего своей семьи он соглашается, пообещав жене успеть к родам. Но все идет не по плану, и дело оборачивается конфликтом с преступной группировкой угонщиков премиальных авто. Теперь перед Саней стоит задача повышенной сложности: не только разобраться с преступниками, но и не опоздать в роддом!",

        },
        {id: "f1",
            name:"F1",
            data: "2025 г",
            tim: "155 мин",
            src: "photo/пост3.png",
            alt: "фото F1",
            synopsis: "В 1990-х Сонни Хейс был восходящей звездой «Формулы-1», но после серьёзной аварии ушёл из большого спорта. 30 лет спустя Сонни живёт в трейлере и зарабатывает участием в различных гонках и чемпионатах. Однажды к нему обращается старый друг Рубен Сервантес, тоже в прошлом гонщик, а ныне владелец гоночной команды-аутсайдера, с просьбой присоединиться к ним в качестве второго пилота и наставника для молодого многообещающего новичка.",

        },
        {id: "identifikaciy",
            name:"Идентификация",
            data: "28 августа 2025г",
            tim: "84 мин",
            src: "photo/пост4.png",
            alt: "фото F1",
            synopsis: "Леон приходит в себя в палате и обнаруживает, что ничего не помнит о своём прошлом, а в его мозг имплантирован нейрочип. Пытаясь выяснить, кто и почему стёр его память, он понимает, что стал пешкой в изощрённой игре, где никому нельзя доверять, а под смертельной угрозой находятся жизни его близких.",

        },
        {id: "chil_shpion",
            name:"Дети-шпионы",
            data: " 21 августа 2025 г",
            tim: "91 мин",
            src: "photo/пост5.png",
            alt: "фото  Дети-шпионы",
            synopsis: "Семья спецагентов воспитывает сына и двух дочерей, каждый из них обладает уникальными способностями. Михаил — компьютерный гений, Вита владеет гипнозом, Дана — мастер спорта по единоборствам. Вместе они создали своё агентство шпионов «ДаМиНик». Их цель — стать суперагентами и найти свою маму, которую не смог отыскать суперагент «Голос» — их отец. В это же время в соседнем королевстве «Карбона» похищают сына короля. Преступники выдвигают требование — выдать арестованного главаря мафии «Карбона» и агента «Голос», организовавшего арест. Для выполнения операции агент «Голос» с семьёй прибывает к королю, а детей отправляет на подготовку в лагерь секретных агентов, осуществляя тем самым их мечту и скрывая свою истинную работу.",

        },
        {id: "tim_and_com",
            name:"Тимур и его команда",
            data: " 28 августа 2025 г",
            tim: "93 мин",
            src: "photo/пост6.png",
            alt: "фото  Тимур и его команда",
            synopsis: "Семнадцатилетняя школьница Женя приезжает из Санкт-Петербурга в приграничный посёлок Белгородской области, чтобы увидеться со своим братом-добровольцем перед его отбытием в зону проведения СВО. Там она знакомится с местным неформальным лидером с позывным «Тимур».",

        },
        {id: "fem_prizr",
            name:"Семейный призрак",
            data: "28 августа 2025 г",
            tim: "84 мин",
            src: "photo/пост7.png",
            alt: "фото Семейный призрак",
            synopsis: "Василий Кирсанов — бывший банковский клерк, а теперь иллюзионист-неудачник, мечтающий устроить шоу «почти как у Копперфильда». Ради сцены он уговаривает жену Светлану продать просторную квартиру и переехать с двумя детьми в тесную однушку. Шоу проваливается, а в новой квартире жить невозможно. В отчаянных поисках решения Кирсанов находит подозрительно выгодное объявление и покупает просторную трёшку на последние деньги. Вот только квартира оказывается не пустой — в ней живёт самый настоящий призрак.",

        },
        {id: "wearons",
            name:"Орудия",
            data: "2025 г",
            tim: "128 мин",
            src: "photo/пост8.png",
            alt: "фото Орудия",
            synopsis: "Все дети из одного школьного класса, за исключением одного ребёнка, одновременно бесследно исчезают. Местные жители и семьи пытаются понять, что или кто стал причиной их исчезновения.",

        },
        {id: "ved_dock",
            name:"Ведьмина доска",
            data: "2025 г",
            tim: "112 мин",
            src: "photo/пост9.png",
            alt: "фото Ведьмина доска",
            synopsis: "Новый Орлеан. Готовясь к открытию кафе, Эмили и Кристиан находят старинную спиритическую доску, пробуждающую в Эмили одержимость духом Королевы ведьм. Кристиан пытается помочь невесте, ведь с каждым колебанием маятника начинается опасная игра, на кон которой поставлена её душа. За помощью он обращается к медиуму, не зная о его тайной связи с ведьмами.",

        },
        {id: "seven_day",
            name:"Семь дней Петра Семёныча",
            data: "28 августа 2025 г",
            tim: "88 мин",
            src: "photo/пост10.png",
            alt: "фото Семь дней Петра Семёныча",
            synopsis: "70-летний Петр Семёныч всю свою жизнь прожил на Черноморском побережье. Он давно одинок: жена умерла, а дочь много лет назад уехала жить в Турцию и не выходит на связь. В начале фильма герою ставят диагноз — саркома легкого. Петр Семёныч принимает болезнь как факт — начинает свыкаться с новой реальностью и подводить итоги. Однако есть надежда, что диагноз неточный. Внести ясность может «светило» из Москвы, который через неделю даст ответ. За эти семь дней Петр Семёныч по-другому взглянет на свою жизнь: вспомнит самые лучшие и худшие, по его мнению, события, попробует отыскать новый смысл существования, найдет в себе силы изменить свою жизнь и обретет надежду.",

        },
        
    ], 
    tomorrow: [
        {id: "f1",
            name:"F1",
            data: "2025 г",
            tim: "155 мин",
            src: "photo/пост3.png",
            alt: "фото F1",
            synopsis: "В 1990-х Сонни Хейс был восходящей звездой «Формулы-1», но после серьёзной аварии ушёл из большого спорта. 30 лет спустя Сонни живёт в трейлере и зарабатывает участием в различных гонках и чемпионатах. Однажды к нему обращается старый друг Рубен Сервантес, тоже в прошлом гонщик, а ныне владелец гоночной команды-аутсайдера, с просьбой присоединиться к ним в качестве второго пилота и наставника для молодого многообещающего новичка.",

        },
        {id: "identifikaciy",
            name:"Идентификация",
            data: "28 августа 2025г",
            tim: "84 мин",
            src: "photo/пост4.png",
            alt: "фото F1",
            synopsis: "Леон приходит в себя в палате и обнаруживает, что ничего не помнит о своём прошлом, а в его мозг имплантирован нейрочип. Пытаясь выяснить, кто и почему стёр его память, он понимает, что стал пешкой в изощрённой игре, где никому нельзя доверять, а под смертельной угрозой находятся жизни его близких.",

        }
    ],
    '2025-09-08': [
        {id: "chil_shpion",
            name:"Дети-шпионы",
            data: " 21 августа 2025 г",
            tim: "91 мин",
            src: "photo/пост5.png",
            alt: "фото  Дети-шпионы",
            synopsis: "Семья спецагентов воспитывает сына и двух дочерей, каждый из них обладает уникальными способностями. Михаил — компьютерный гений, Вита владеет гипнозом, Дана — мастер спорта по единоборствам. Вместе они создали своё агентство шпионов «ДаМиНик». Их цель — стать суперагентами и найти свою маму, которую не смог отыскать суперагент «Голос» — их отец. В это же время в соседнем королевстве «Карбона» похищают сына короля. Преступники выдвигают требование — выдать арестованного главаря мафии «Карбона» и агента «Голос», организовавшего арест. Для выполнения операции агент «Голос» с семьёй прибывает к королю, а детей отправляет на подготовку в лагерь секретных агентов, осуществляя тем самым их мечту и скрывая свою истинную работу.",

        },
        {id: "tim_and_com",
            name:"Тимур и его команда",
            data: " 28 августа 2025 г",
            tim: "93 мин",
            src: "photo/пост6.png",
            alt: "фото  Тимур и его команда",
            synopsis: "Семнадцатилетняя школьница Женя приезжает из Санкт-Петербурга в приграничный посёлок Белгородской области, чтобы увидеться со своим братом-добровольцем перед его отбытием в зону проведения СВО. Там она знакомится с местным неформальным лидером с позывным «Тимур».",

        },
    ],
    '2025-09-09': [
        {id: "fem_prizr",
            name:"Семейный призрак",
            data: "28 августа 2025 г",
            tim: "84 мин",
            src: "photo/пост7.png",
            alt: "фото Семейный призрак",
            synopsis: "Василий Кирсанов — бывший банковский клерк, а теперь иллюзионист-неудачник, мечтающий устроить шоу «почти как у Копперфильда». Ради сцены он уговаривает жену Светлану продать просторную квартиру и переехать с двумя детьми в тесную однушку. Шоу проваливается, а в новой квартире жить невозможно. В отчаянных поисках решения Кирсанов находит подозрительно выгодное объявление и покупает просторную трёшку на последние деньги. Вот только квартира оказывается не пустой — в ней живёт самый настоящий призрак.",

        },
        {id: "wearons",
            name:"Орудия",
            data: "2025 г",
            tim: "128 мин",
            src: "photo/пост8.png",
            alt: "фото Орудия",
            synopsis: "Все дети из одного школьного класса, за исключением одного ребёнка, одновременно бесследно исчезают. Местные жители и семьи пытаются понять, что или кто стал причиной их исчезновения.",

        }
    ],
    '2025-09-10': [
        {id: "ved_dock",
            name:"Ведьмина доска",
            data: "2025 г",
            tim: "112 мин",
            src: "photo/пост9.png",
            alt: "фото Ведьмина доска",
            synopsis: "Новый Орлеан. Готовясь к открытию кафе, Эмили и Кристиан находят старинную спиритическую доску, пробуждающую в Эмили одержимость духом Королевы ведьм. Кристиан пытается помочь невесте, ведь с каждым колебанием маятника начинается опасная игра, на кон которой поставлена её душа. За помощью он обращается к медиуму, не зная о его тайной связи с ведьмами.",

        },
        {id: "seven_day",
            name:"Семь дней Петра Семёныча",
            data: "28 августа 2025 г",
            tim: "88 мин",
            src: "photo/пост10.png",
            alt: "фото Семь дней Петра Семёныча",
            synopsis: "70-летний Петр Семёныч всю свою жизнь прожил на Черноморском побережье. Он давно одинок: жена умерла, а дочь много лет назад уехала жить в Турцию и не выходит на связь. В начале фильма герою ставят диагноз — саркома легкого. Петр Семёныч принимает болезнь как факт — начинает свыкаться с новой реальностью и подводить итоги. Однако есть надежда, что диагноз неточный. Внести ясность может «светило» из Москвы, который через неделю даст ответ. За эти семь дней Петр Семёныч по-другому взглянет на свою жизнь: вспомнит самые лучшие и худшие, по его мнению, события, попробует отыскать новый смысл существования, найдет в себе силы изменить свою жизнь и обретет надежду.",

        }
    ]
};


document.addEventListener("DOMContentLoaded", () => {
    const button = document.querySelectorAll('.bt-dat');
    const filtr = document.getElementById('now');
    const galery = document.getElementById('gallery');

    renderGaler('today');

    filtr.querySelector('[data-filter="today"]').classList.add('active');

    filtr.addEventListener('click', (e) => {
        const btn = e.target.closest('.bt-dat');
        if (!btn) return;

        filtr.querySelectorAll('.bt-dat').forEach(b => b.classList.remove('active'));

        btn.classList.add('active');

        const key = btn.dataset.filter;

        renderGaler(key);
    });

    function renderGaler(key) {
        const itm = postItms[key] || [];

        galery.innerHTML = '';

        if (!itm.length) {
            const empty = document.createElement('p');
            empty.textContent = "В этот день сеансов нет";
            empty.style.opacity = '.8';
            galery.appendChild(empty);
            return
        }

        const flag = document.createDocumentFragment();

        for (const it of itm){
            const link = document.createElement('a');
            link.href = `details.html?id=${encodeURIComponent(it.id||'')}`;
            const img = document.createElement('img');
            img.className = 'post';
            img.src = it.src;
            img.alt = it.alt || '';
            img.loading = 'lazy';
            link.appendChild(img)
            flag.appendChild(link);
        }
        galery.appendChild(flag);
    }

    
});